/*
NextJS:  (динамические)
- если нужно обновление данных без пересборки

Gatsby: (статические информационный сайт, блок, который редко обнвляется)
- если не нужны динамическое обновление данных
- GraphQL (из коробки)



NextJS:
- SSG (статическая генерация), SSR(когда страница рендерится на сревере, потом отдается на клиент) и 
	инкрементальная статическая генерация(когда некст в фоне валидирует пришедшие данные и после этого генерит нам страницу)
- Оптимизация изображений
- Роутинг, включая интрернализацию(позволяет поддомены)
- Code-spliting(разбитие на бандлы)
- Поддержка ts
- CSS modules и SASS
- Fast refresh при разработке (при изменении стилей мгновенно показывает изменения в браузере)
*/

